OpenFOAM-v1812/modules/OpenQBMM/tutorials/diluteVdfTransportFoam/rotatingCylinder/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    particles
);

boundaries
{
    walls
    {
        type    zeroGradient;
    }
    outlet
    {
        type    zeroGradient;
    }
}

particles
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];

    default
    {
        node0
        {
            weight  uniform 0.001;
            abscissae (0 0);
        }
    }

}


// ************************************************************************* //
